# 1. Import Library

In [1]:
import pandas as pd

# 2. Load Data

## Title Basics

In [2]:
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

## Title Ratings

In [3]:
ratings = pd.read_csv('Data/title_ratings.csv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2625
3  tt0000006            5.1       182
4  tt0000007            5.4       820

## The TMDB API Results (tmdb_results_combined)

In [4]:
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.100,2244.0,PG
3,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.105,185.0,R
4,tt0120263,0.0,/ynXVuylP8upazjz8lrqb1PEMkdR.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,34070.0,sv,Sånger från andra våningen,...,80334.0,99.0,"[{'english_name': 'Russian', 'iso_639_1': 'ru'...",Released,NaN,Songs from the Second Floor,0.0,7.200,239.0,NaN

# 3. Inspect and Prepare Data

In [5]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81799 entries, 0 to 81798
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81799 non-null  object
 1   titleType       81799 non-null  object
 2   primaryTitle    81799 non-null  object
 3   originalTitle   81799 non-null  object
 4   isAdult         81799 non-null  int64
 5   startYear       81799 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81799 non-null  int64
 8   genres          81799 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.6+ MB

In [6]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 502224 entries, 0 to 502223
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         502224 non-null  object
 1   averageRating  502224 non-null  float64
 2   numVotes       502224 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [7]:
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641 entries, 0 to 640
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                641 non-null    object
 1   adult                  639 non-null    float64
 2   backdrop_path          541 non-null    object
 3   belongs_to_collection  111 non-null    object
 4   budget                 639 non-null    float64
 5   genres                 639 non-null    object
 6   homepage               76 non-null     object
 7   id                     639 non-null    float64
 8   original_language      639 non-null    object
 9   original_title         639 non-null    object
 10  overview               637 non-null    object
 11  popularity             639 non-null    float64
 12  poster_path            621 non-null    object
 13  production_companies   639 non-null    object
 14  production_countries   639 non-null    object
 15  release_date           638 non-null    object
 16  revenue                639 non-null    float64
 17  runtime                639 non-null    float64
 18  spoken_languages       639 non-null    object
 19  status                 639 non-null    object
 20  tagline                501 non-null    object
 21  title                  639 non-null    object
 22  video                  639 non-null    float64
 23  vote_average           639 non-null    float64
 24  vote_count             639 non-null    float64
 25  certification          430 non-null    object
dtypes: float64(9), object(17)
memory usage: 130.3+ KB

### **NOTE**: 

The above `tmdb` dataframe is the **filtered version** where I excluded any movies that had 0 value for budget AND revenue.

Below, I will separately prepare an unfiltered, original combined dataframe to use for MySQL database.

#### Unfiltered `tmdb_data` dataframe

In [8]:
final_tmdb_data_2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
final_tmdb_data_2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')
# concatenate the data into 1 dataframe
tmdb_data = pd.concat([final_tmdb_data_2000, final_tmdb_data_2001], ignore_index=True)
## Save dataframe to file.
tmdb_data.to_csv("Data/tmdb_results_combined_unfiltered.csv.gz",compression='gzip',index=False)

In [9]:
tmdb_data = pd.read_csv('Data/tmdb_results_combined_unfiltered.csv.gz')
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.0,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,2244.0,PG

In [10]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2584 entries, 0 to 2583
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2584 non-null   object
 1   adult                  2582 non-null   float64
 2   backdrop_path          1416 non-null   object
 3   belongs_to_collection  210 non-null    object
 4   budget                 2582 non-null   float64
 5   genres                 2582 non-null   object
 6   homepage               171 non-null    object
 7   id                     2582 non-null   float64
 8   original_language      2582 non-null   object
 9   original_title         2582 non-null   object
 10  overview               2534 non-null   object
 11  popularity             2582 non-null   float64
 12  poster_path            2329 non-null   object
 13  production_companies   2582 non-null   object
 14  production_countries   2582 non-null   object
 15  release_date           2558 non-null   object
 16  revenue                2582 non-null   float64
 17  runtime                2582 non-null   float64
 18  spoken_languages       2582 non-null   object
 19  status                 2582 non-null   object
 20  tagline                1111 non-null   object
 21  title                  2582 non-null   object
 22  video                  2582 non-null   float64
 23  vote_average           2582 non-null   float64
 24  vote_count             2582 non-null   float64
 25  certification          813 non-null    object
dtypes: float64(9), object(17)
memory usage: 525.0+ KB

## Required Transformation Steps for Title Basics:
#### Normalize Genre:

- Convert the single string of genres from title basics into 2 new tables.
1. title_genres: with the columns:

   - tconst
   - genre_id


2. genres:
   - genre_id
   - genre_name
   
#### Discard unnecessary information:

- For the `title basics` table, drop the following columns:
    - "original_title" (we will use the primary title column instead)
    - "isAdult" ("Adult" will show up in the genres so this is redundant information).
    - "titleType" (every row will be a movie).
    - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

- Do not include the `title_akas` table in your SQL database.
    - You have already filtered out the desired movies using this table, and the remaining data is mostly nulls and not of interest to the stakeholder.

## 3.1 Normalize Genre

##### 1. Get a list of all individual genres.

- First, I will need to get a list of all of the unique genres that appear in the column. 
- Right now, the genre column contains a string with the genres separated by a comma.
- I am going to convert these strings into lists of strings into a new 'genres_split' column.

In [11]:
# check the current column names
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81799 entries, 0 to 81798
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81799 non-null  object
 1   titleType       81799 non-null  object
 2   primaryTitle    81799 non-null  object
 3   originalTitle   81799 non-null  object
 4   isAdult         81799 non-null  int64
 5   startYear       81799 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81799 non-null  int64
 8   genres          81799 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.6+ MB

In [12]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History","[Drama, History]"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
81794,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
81795,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81796,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
81797,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81798,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

**Use .explode() to separate the list of genres into new rows: one row for each genre a movie belonged to.**

In [13]:
# explode the series using .explode()
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History",Drama
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History",History
...,...,...,...,...,...,...,...,...,...,...
81797,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
81797,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
81797,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
81798,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
81798,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

**Use .unique() to get the unique genres from the genres_split column and sort alphabetically**

In [14]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [15]:
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

##### 2. Create a new `title_genres` table

We only want the tconst and genres_split columns.

In [16]:
#Create a new dataframe which only contains the necessary columns
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

##### 3. Create a genre mapper dictionary to replace string genres with integers

In [17]:
## Making the genre mapper dictionary
### Make a dictionary with list of unique genres as the key and unique integer ids as values
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

##### 4. Replace the string genres in title_genres with the new integer ids.

In [18]:
## make a new integer column called "genre_id", and drop the string "genres_split" column
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

Now the `title_genres` table is ready for MySQL database.

##### 5. Convert the genre map dictionary into a dataframe.

In [19]:
# Make a dataframe with Genre_Name and Genre_ID columns
genre = pd.DataFrame({'Genre_Name': genre_map.keys(), 
                      'Genre_ID': genre_map.values()})
genre.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

Now the `genres` table is ready for MySQL database.

## 3.2 Discard unnecessary information:

- For the `title basics` table, drop the following columns:
    - "original_title" (we will use the primary title column instead)
    - "isAdult" ("Adult" will show up in the genres so this is redundant information).
    - "titleType" (every row will be a movie).
    - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [20]:
# Display the current columns
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81799 entries, 0 to 81798
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81799 non-null  object
 1   titleType       81799 non-null  object
 2   primaryTitle    81799 non-null  object
 3   originalTitle   81799 non-null  object
 4   isAdult         81799 non-null  int64
 5   startYear       81799 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81799 non-null  int64
 8   genres          81799 non-null  object
 9   genres_split    81799 non-null  object
dtypes: float64(1), int64(3), object(6)
memory usage: 6.2+ MB

In [21]:
# Drop the unnecessary columns
basics = basics.drop(columns=['originalTitle', 'isAdult','titleType','genres', 'genres_split'])
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
3,tt0069049,The Other Side of the Wind,2018,NaN,122
4,tt0088751,The Naked Monster,2005,NaN,100

In [22]:
# Check the final column names for Title Basics
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81799 entries, 0 to 81798
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81799 non-null  object
 1   primaryTitle    81799 non-null  object
 2   startYear       81799 non-null  int64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  81799 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.1+ MB

# 4. Construct MySQL Database

## MySQL Database Requirements

- Use sqlalchemy with Pandas to execute your SQL queries inside your notebook.

- Create a new database on your MySQL server and call it "movies."

- Make sure to have the following tables in your "movies" database:

   - title_basics
   - title_ratings
   - title_genres
   - genres
   - tmdb_data

- Make sure to set a Primary Key for each table that isn't a joiner table (e.g., title_genres is a joiner table).

- After creating each table, show the first 5 rows of that table using a SQL query.

- Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

## 4.1 Establish connection to MySQL and Create Database

In [23]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
# call the new database "movies"
connection_str = "mysql+pymysql://root:root@localhost/movies"

In [24]:
engine = create_engine(connection_str)

In [25]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

## 4.2 Create Required Tables in the database & Set Primary Key for each table

Required Tables:
   - title_basics
   - title_ratings
   - title_genres
   - genres
   - tmdb_data

### `title_basics`

In [26]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81799 entries, 0 to 81798
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81799 non-null  object
 1   primaryTitle    81799 non-null  object
 2   startYear       81799 non-null  int64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  81799 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.1+ MB

In [27]:
# change dtype of startYear to float to match the dtype in the example code that I will use in the next step 
basics['startYear'] = basics['startYear'].astype(float)
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81799 entries, 0 to 81798
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81799 non-null  object
 1   primaryTitle    81799 non-null  object
 2   startYear       81799 non-null  float64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  81799 non-null  int64
dtypes: float64(2), int64(1), object(2)
memory usage: 3.1+ MB

Primary Key: `tconst`

Since "tconst" is a string column, I will need to go through some extra steps in order to set this column as the Primary Key.

#### Saving the MySQL tables with tconst as the primary key.

##### 1. Create a dataype schema for to_sql:

In [28]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

##### 2. Run df.to_sql with the dtype argument.

In [29]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

81799

##### 3. Run the query to ADD PRIMARY KEY

In [30]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

##### Display first 5 rows

In [31]:
# Disply first 5 rows of the table
q = """
SELECT * 
FROM title_basics 
LIMIT 5; """

pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0043139,Life of a Beijing Policeman,2013.0,None,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
3,tt0069049,The Other Side of the Wind,2018.0,None,122
4,tt0088751,The Naked Monster,2005.0,None,100

### `title_ratings`

In [32]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 502224 entries, 0 to 502223
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         502224 non-null  object
 1   averageRating  502224 non-null  float64
 2   numVotes       502224 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

##### 1. Create a dataype schema for to_sql:

In [33]:
## Calculate max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema_ratings = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

##### 2. Run df.to_sql with the dtype argument.

In [34]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=df_schema_ratings,if_exists='replace',index=False)

502224

##### 3. Run the query to ADD PRIMARY KEY

In [35]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

##### Display first 5 rows

In [36]:
# Disply first 5 rows of the table
q = """
SELECT * 
FROM title_ratings
LIMIT 5; """

pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2625
3  tt0000006            5.1       182
4  tt0000007            5.4       820

### `title_genres`

In [37]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 153289 entries, 0 to 81798
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    153289 non-null  object
 1   genre_id  153289 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

##### 1. Create a dataype schema for to_sql:

In [38]:
## Calculate max string lengths for object columns
tconst_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema_title_genres = {
    'tconst': Text(tconst_len+1), 
    'genre_id':Integer()}

##### 2. Run df.to_sql with the dtype argument.

In [39]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=df_schema_title_genres,if_exists='replace',index=False)

153289

`title_genres` is a joiner table, therefore, we do not need to set primary key.

##### Display first 5 rows

In [40]:
# Disply first 5 rows of the table
q = """
SELECT * 
FROM title_genres 
LIMIT 5; """

pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0043139         7
4  tt0043139        11

### `genres`

In [41]:
genre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_Name  25 non-null     object
 1   Genre_ID    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

##### 1. Create a dataype schema for to_sql:

In [42]:
## Calculate max string lengths for object columns
name_len = genre['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema_genres = {
    'Genre_Name': Text(tconst_len+1), 
    'Genre_ID':Integer()}

##### 2. Run df.to_sql with the dtype argument.

In [43]:
# Save to sql with dtype and index=False
genre.to_sql('genres',engine,dtype=df_schema_genres,if_exists='replace',index=False)

25

##### 3. Run the query to ADD PRIMARY KEY

In [44]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

##### Display first 5 rows

In [45]:
# Disply first 5 rows of the table
q = """
SELECT * 
FROM genres
LIMIT 5; """

pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### `tmdb_data`

In [46]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2584 entries, 0 to 2583
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2584 non-null   object
 1   adult                  2582 non-null   float64
 2   backdrop_path          1416 non-null   object
 3   belongs_to_collection  210 non-null    object
 4   budget                 2582 non-null   float64
 5   genres                 2582 non-null   object
 6   homepage               171 non-null    object
 7   id                     2582 non-null   float64
 8   original_language      2582 non-null   object
 9   original_title         2582 non-null   object
 10  overview               2534 non-null   object
 11  popularity             2582 non-null   float64
 12  poster_path            2329 non-null   object
 13  production_companies   2582 non-null   object
 14  production_countries   2582 non-null   object
 15  release_date           2558 non-null   object
 16  revenue                2582 non-null   float64
 17  runtime                2582 non-null   float64
 18  spoken_languages       2582 non-null   object
 19  status                 2582 non-null   object
 20  tagline                1111 non-null   object
 21  title                  2582 non-null   object
 22  video                  2582 non-null   float64
 23  vote_average           2582 non-null   float64
 24  vote_count             2582 non-null   float64
 25  certification          813 non-null    object
dtypes: float64(9), object(17)
memory usage: 525.0+ KB

**Observation**: 

There are two "id" columns in this dataframe: `imdb_id` and `id`.

I will check the values in each column to determine which is more suitable as the Primary Key.

In [47]:
#check the values in the imdb_id column

tmdb_data['imdb_id'].value_counts()

0            2
tt0250720    1
tt0252501    1
tt0252503    1
tt0252684    1
            ..
tt0252335    1
tt0252445    1
tt0252703    1
tt0252884    1
tt9212730    1
Name: imdb_id, Length: 2583, dtype: int64

The values in this column match the values in `tconst` column in other tables.

In [48]:
#check the values in the id column

tmdb_data['id'].value_counts()

62127.0     1
39180.0     1
11313.0     1
11088.0     1
15098.0     1
           ..
140101.0    1
270625.0    1
91958.0     1
412515.0    1
382630.0    1
Name: id, Length: 2582, dtype: int64

The Primary Key is `imdb_id`. 

However, there are duplicated values: '0' in `imdb_id` when I checked using `tmdb_data['imdb_id'].value_counts()` earlier.  

In order to use this column as the Primary Key, I will need to drop one of them (or both of them), because every id must be unique for Primary Key.

In [49]:
#check the index of row which contained the value 0 for imdb_id column
tmdb_data.loc[tmdb_data['imdb_id'] == '0']

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1246,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Both of these rows do not contain any useful data, therefore, I will drop both of these rows.

In [50]:
#drop rows with imdb_id == 0
tmdb_data = tmdb_data[tmdb_data['imdb_id']!='0']

In [51]:
#check to make sure that the rows have been dropped
tmdb_data['imdb_id'].value_counts()

tt0113026    1
tt0250720    1
tt0252501    1
tt0252503    1
tt0252684    1
            ..
tt0252335    1
tt0252445    1
tt0252703    1
tt0252884    1
tt9212730    1
Name: imdb_id, Length: 2582, dtype: int64

The requirement also says that we only need the following columns from this table:
`imdb_id`, `revenue`, `budget`, and `certification`.

Therefore, I will drop all the other columns.

In [52]:
tmdb_data = tmdb_data[['imdb_id', 'revenue','budget','certification']]

In [53]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2582 entries, 1 to 2583
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2582 non-null   object
 1   revenue        2582 non-null   float64
 2   budget         2582 non-null   float64
 3   certification  813 non-null    object
dtypes: float64(2), object(2)
memory usage: 100.9+ KB

##### 1. Create a dataype schema for to_sql:

In [54]:
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
text_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema_tmdb = {
    "imdb_id": String(key_len+1), 
    "revenue":Float(),
    "budget":Float(),
    "certification": Text(text_len+1)}

##### 2. Run df.to_sql with the dtype argument.

In [55]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine,dtype=df_schema_tmdb,if_exists='replace',index=False)

2582

##### 3. Run the query to ADD PRIMARY KEY

In [56]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

##### Display first 5 rows

In [57]:
# Disply first 5 rows of the table
q = """
SELECT * 
FROM tmdb_data
LIMIT 5; """

pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

## 4.3 Double-Check the Primary Key with Reverse Engineering

![PNG](ReverseEngineer_ERD.png)

## 4.4 SHOW TABLES

In [58]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data